
#Область ИнтерфейсПечати

Функция ОписатьПравилаЗаполненияПодписей() Экспорт
	
	РеквизитыОбъекта = Новый Соответствие;
	
	РеквизитыОбъекта.Вставить("ПодписьРуководителя", "Организация.ПодписьРуководителя");
	РеквизитыОбъекта.Вставить("ПодписьКладовщика", "СтруктурнаяЕдиница.ПодписьМОЛ");
	РеквизитыОбъекта.Вставить("Комиссия", "ЭтоКомиссия");
	
	Возврат РеквизитыОбъекта;
	
КонецФункции

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
	ПараметрыНоменклатуры = Новый Структура;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ОтчетПроизводстваЗаСменуОкорка";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "РеестрВыборотки" Тогда
			ПечатьРеестр(ТабличныйДокумент, ТекущийДокумент);
					
			
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрВыборотки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрВыборотки", НСтр("ru = 'Реестр выборотки'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РеестрВыборотки"));
		
	КонецЕсли;
	
	
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов,
		КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрВыборотки";
	КомандаПечати.Представление = НСтр("ru = 'Реестр выборотки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "ТОРГ4";
//	КомандаПечати.Представление = НСтр("ru = 'ТОРГ4 (Акт о приемке товара)'");
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 4;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "ПриходныйОрдер";
//	КомандаПечати.Представление = НСтр("ru = 'Приходный ордер'");
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 7;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "БланкТоварногоНаполнения";
//	КомандаПечати.Представление = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

#КонецОбласти

Процедура ПечатьРеестр(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ОтчетПроизводстваЗаСменуЛесоцех.ПолучитьМакет("ПечатьРеестр");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ОтчетПроизводстваЗаСменуЛесоцех.Номер,
		|	ОтчетПроизводстваЗаСменуЛесоцех.Дата,
		|	ОтчетПроизводстваЗаСменуЛесоцех.Организация,
		|	ОтчетПроизводстваЗаСменуЛесоцех.Подразделение,
		|	ОтчетПроизводстваЗаСменуЛесоцех.Автор,
		|	ОтчетПроизводстваЗаСменуЛесоцех.ДатаНачала,
		|	ОтчетПроизводстваЗаСменуЛесоцех.ДатаОкончания,
		|	ОтчетПроизводстваЗаСменуЛесоцех.Сырье.(
		|		НомерСтроки,
		|		Номенклатура,
		|		Порода,
		|		Диаметр,
		|		Количество,
		|		КоличествоШтук,
		|		Длина,
		|		Штабель,
		|		СкладСырья),
		|	ОтчетПроизводстваЗаСменуЛесоцех.Постав.(
		|		НомерСтроки,
		|		Номенклатура,
		|		Порода,
		|		Сорт,
		|		Длина,
		|		Ширина,
		|		Толщина,
		|		КоличествоДосок,
		|		ОбъемДосок,
		|		ЦентральнаяДоска,
		|		СкладПолучатель)
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСменуЛесоцех КАК ОтчетПроизводстваЗаСменуЛесоцех
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуЛесоцех.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСырьеШапка = Макет.ПолучитьОбласть("СырьеШапка");
	ОбластьСырье = Макет.ПолучитьОбласть("Сырье");ОбластьПоставШапка = Макет.ПолучитьОбласть("ПоставШапка");
	ОбластьПостав = Макет.ПолучитьОбласть("Постав");
	
	
	Пока Выборка.Следующий() Цикл
		

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьСырьеШапка);
		ВыборкаСырье = Выборка.Сырье.Выбрать();
		Пока ВыборкаСырье.Следующий() Цикл
			ОбластьСырье.Параметры.Заполнить(ВыборкаСырье);
			ТабДок.Вывести(ОбластьСырье, ВыборкаСырье.Уровень());
		КонецЦикла;		ТабДок.Вывести(ОбластьПоставШапка);
		ВыборкаПостав = Выборка.Постав.Выбрать();
		Пока ВыборкаПостав.Следующий() Цикл
			ОбластьПостав.Параметры.Заполнить(ВыборкаПостав);
			ТабДок.Вывести(ОбластьПостав, ВыборкаПостав.Уровень());
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
