
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДата()); 
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад); 
	Если Параметры.ЕстьУсловиеПоЗапросу Тогда
		Список.ТекстЗапроса = Список.ТекстЗапроса+"
		|";
		УсловиеПервое = Ложь;
		Если Параметры.СостояниеПакета <> 0 Тогда
			Если УсловиеПервое Тогда
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				|ЕСТЬNULL(СостояниеПакетаСрезПоследних.Состояние, 0) = &СостояниеПакета 
				|"; 
				УсловиеПервое = Ложь;
			Иначе
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				| И ЕСТЬNULL(СостояниеПакетаСрезПоследних.Состояние, 0) = &СостояниеПакета
				|"; 				
			КонецЕсли;
			Список.Параметры.УстановитьЗначениеПараметра("СостояниеПакета", ?(Параметры.СостояниеПакета<0,0,Параметры.СостояниеПакета));
		КонецЕсли;
		Если Параметры.Номеклатура.Количество()>0 Тогда
			Если УсловиеПервое Тогда
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				|СправочникПакеты.Номенклатура В (&Номенклатура) 
				|"; 
				УсловиеПервое = Ложь;
			Иначе
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				| И СправочникПакеты.Номенклатура В (&Номенклатура) 
				|"; 				
			КонецЕсли;
			Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номеклатура);		
		КонецЕсли;
		Если Параметры.ХарактеристикаНоменклатуры.Количество()>0 Тогда
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХарактеристикаНоменклатуры");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПредставлениеПользовательскойНастройки  ="";
			ЭлементОтбора.ПравоеЗначение = Параметры.ХарактеристикаНоменклатуры;			
			//Если УсловиеПервое Тогда
			//	Список.ТекстЗапроса = Список.ТекстЗапроса+"
			//	|СправочникПакеты.ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры) 
			//	|"; 
			//	УсловиеПервое = Ложь;
			//Иначе
			//	Список.ТекстЗапроса = Список.ТекстЗапроса+"
			//	| И СправочникПакеты.ХарактеристикаНоменклатуры В ИЕРАРХИИ(&ХарактеристикаНоменклатуры) 
			//	|"; 				
			//КонецЕсли;
			//Список.Параметры.УстановитьЗначениеПараметра("ХарактеристикаНоменклатуры", Параметры.ХарактеристикаНоменклатуры);		
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Значение);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
