Процедура ПроведениеПоДвижениюПроизводства(Движения, ДокументСсылка, Отказ) Экспорт
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходныйОрдерНаКруглыйЛесоматериал") Тогда
		Если ДокументСсылка.ЗамерыРучнойУчет.количество() > 0 Тогда
			Движения.ДвижениеПоПроизводству.Записывать = Истина;
			Для Каждого ТекСтрокаДанные Из ДокументСсылка.ЗамерыРучнойУчет Цикл
				Движение = Движения.ДвижениеПоПроизводству.Добавить();
				Движение.Период = ДокументСсылка.Дата;
				Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.Приемка;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
				Движение.Пакет_Штабель = ТекСтрокаДанные.Штабель;
				Движение.Объем = ТекСтрокаДанные.Количество;
				Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиКруглогоЛесоматериала(
			ТекСтрокаДанные.Диаметр, ТекСтрокаДанные.Порода, ТекСтрокаДанные.Длина,
					ТекСтрокаДанные.Номенклатура);
				Если ТекСтрокаДанные.КоличествоШтукБрак > 0 Тогда
					Движение = Движения.ДвижениеПоПроизводству.Добавить();
					Движение.Период = ДокументСсылка.Дата;
					Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.Приемка;
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Номенклатура = ТекСтрокаДанные.НоменклатураБрак;

					Движение.Объем = ТекСтрокаДанные.Количество;
				КонецЕсли;
			КонецЦикла;

		Иначе
			Движения.ДвижениеПоПроизводству.Записывать = Истина;
			Для Каждого ТекСтрокаДанные Из ДокументСсылка.ДанныеПачек Цикл
				Движение = Движения.ДвижениеПоПроизводству.Добавить();
				Движение.Период = ДокументСсылка.Дата;
				Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.Приемка;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
				Движение.Пакет_Штабель = ТекСтрокаДанные.Штабель;
				Движение.Объем = ТекСтрокаДанные.Количество;
				Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиКруглогоЛесоматериала(
			ТекСтрокаДанные.Диаметр, ТекСтрокаДанные.Порода, ТекСтрокаДанные.ДлинаПачки, ТекСтрокаДанные.Номенклатура);
				
			КонецЦикла;

		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСменуОкорка") Тогда
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.ЗамерыРучнойУчет Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.Окорка;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			Движение.Пакет_Штабель = ТекСтрокаДанные.Штабель;
			Движение.Объем = ТекСтрокаДанные.Количество;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоШтук;
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиКруглогоЛесоматериала(
			ТекСтрокаДанные.Диаметр, ТекСтрокаДанные.Порода, ТекСтрокаДанные.Длина, ТекСтрокаДанные.Номенклатура);

		КонецЦикла;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Сырье Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.Приемка;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			Движение.Пакет_Штабель = ТекСтрокаДанные.Штабель;
			Движение.Объем = ТекСтрокаДанные.Количество;
			
			Движение.ХарактеристикаНоменклатуры = ТекСтрокаДанные.ХарактристикаНоменклатуры;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСменуЛесоцех") Тогда
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Сырье Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.Окорка;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			Движение.Пакет_Штабель = ТекСтрокаДанные.Штабель;
			Движение.Объем = ТекСтрокаДанные.Количество;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоШтук;
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиКруглогоЛесоматериала(
			ТекСтрокаДанные.Диаметр, ТекСтрокаДанные.Порода, ТекСтрокаДанные.Длина, ТекСтрокаДанные.Номенклатура);

		КонецЦикла;	
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Постав Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.Лесоцех;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			
			Движение.Объем = ТекСтрокаДанные.ОбъемДосок;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Сорт,ТекСтрокаДанные.Длина,Константы.ЗначениеБезУказанияВлажности.Получить(),ТекСтрокаДанные.Номенклатура,Отказ);

		КонецЦикла;	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.УкладкаВШтабель") Тогда
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Состав Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.УложеноВШтабель;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			
			Движение.Объем = ТекСтрокаДанные.ОбъемДосок;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Сорт,ТекСтрокаДанные.Длина,Константы.ЗначениеБезУказанияВлажности.Получить(),ТекСтрокаДанные.Номенклатура,Отказ);

		КонецЦикла;
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Состав Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.Лесоцех;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			
			Движение.Объем = ТекСтрокаДанные.ОбъемДосок;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Сорт,ТекСтрокаДанные.Длина,Константы.ЗначениеБезУказанияВлажности.Получить(),ТекСтрокаДанные.Номенклатура,Отказ);

		КонецЦикла;	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗагрузкаВСушильнуюКамеру") Тогда
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Состав Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.ЗакаткаВКамеры;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			Движение.Пакет_Штабель = ДокументСсылка.СушильнаяКамера;
			Движение.Объем = ТекСтрокаДанные.ОбъемДосок;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Сорт,ТекСтрокаДанные.Длина,Константы.ЗначениеБезУказанияВлажности.Получить(),ТекСтрокаДанные.Номенклатура,Отказ);

		КонецЦикла;
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Состав Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.УложеноВШтабель;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			
			Движение.Объем = ТекСтрокаДанные.ОбъемДосок;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Сорт,ТекСтрокаДанные.Длина,Константы.ЗначениеБезУказанияВлажности.Получить(),ТекСтрокаДанные.Номенклатура,Отказ);

		КонецЦикла;	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВыгрузкаИзСушильнойКамеры") Тогда
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Состав Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.ВыкаткаИзКамер;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			
			Движение.Объем = ТекСтрокаДанные.ОбъемДосок;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Сорт,ТекСтрокаДанные.Длина,Константы.ЗначениеБезУказанияВлажности.Получить(),ТекСтрокаДанные.Номенклатура,Отказ);

		КонецЦикла;
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.ЗагрузкаВСушильнуюКамеру.Состав Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.ЗакаткаВКамеры;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			Движение.Пакет_Штабель = ДокументСсылка.СушильнаяКамера;
			Движение.Объем = ТекСтрокаДанные.ОбъемДосок;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Сорт,ТекСтрокаДанные.Длина,Константы.ЗначениеБезУказанияВлажности.Получить(),ТекСтрокаДанные.Номенклатура,Отказ);

		КонецЦикла;	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСменуЛСП") Тогда
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Выпуск Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.СкладГотовойПродукции;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			Движение.Пакет_Штабель = ТекСтрокаДанные.Пакет;
			Движение.Объем = ТекСтрокаДанные.Объем;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			Движение.ХарактеристикаНоменклатуры = ТекСтрокаДанные.ХарактеристикаНоменклатуры;

		КонецЦикла;
		Движения.ДвижениеПоПроизводству.Записывать = Истина;
		Для Каждого ТекСтрокаДанные Из ДокументСсылка.Сырье Цикл
			Движение = Движения.ДвижениеПоПроизводству.Добавить();
			Движение.Период = ДокументСсылка.Дата;
			Движение.ВидДвиженияПроизводство = Перечисления.ВидыДвиженияПолуфабрикатов.ВыкаткаИзКамер;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
			
			Движение.Объем = ТекСтрокаДанные.ОбъемДосок;
			Движение.КоличествоШт = ТекСтрокаДанные.КоличествоДосок;
			
			Движение.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Сорт,ТекСтрокаДанные.Длина,Константы.ЗначениеБезУказанияВлажности.Получить(),ТекСтрокаДанные.Номенклатура,Отказ);

		КонецЦикла;									
	КонецЕсли;

КонецПроцедуры