
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если обменданными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПриходныйОрдер) Тогда
		 ДокОбъект = Документы.ПриходныйОрдер.СоздатьДокумент(); 
		 ДокОбъект.Дата =  Дата;  
		 ДокОбъект.Организация =  Организация; 
		 Докобъект.Записать(режимзаписидокумента.Запись);
		 ПриходныйОрдер = Докобъект.Ссылка;
	 КонецЕсли;
	 ДокОбъект = ПриходныйОрдер.ПолучитьОбъект();
	 ДокОбъект.Дата =  Дата; 
	 ДокОбъект.Автор = Пользователи.ТекущийПользователь();
	 ДокОбъект.Организация =  Организация; 
	 ДокОбъект.СтруктурнаяЕдиница =  Склад; 
	 ДокОбъект.Контрагент =  Контрагент; 
	 ДокОбъект.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ПриходныйОрдер; 
	 ДокОбъект.Запасы.Очистить();
	Если ЗамерыРучнойУчет.количество() > 0 Тогда
		Для Каждого СтрокаТовары Из ЗамерыРучнойУчет Цикл
			СтрЗапасы = ДокОбъект.Запасы.Добавить();
			СтрЗапасы.Номенклатура = СтрокаТовары.Номенклатура;
			СтрЗапасы.Количество = СтрокаТовары.Количество;
			СтрЗапасы.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаИзмерения;
			СтрЗапасы.Характеристика = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиКруглогоЛесоматериала(
			СтрокаТовары.Диаметр, СтрокаТовары.Порода, СтрокаТовары.Длина, СтрокаТовары.Номенклатура);
			
			Если СтрокаТовары.КоличествоШтукБрак > 0 Тогда
				СтрЗапасы = ДокОбъект.Запасы.Добавить();
				СтрЗапасы.Номенклатура = СтрокаТовары.НоменклатураБрак;
				СтрЗапасы.Количество = СтрокаТовары.КоличествоБрак;
				СтрЗапасы.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТовары Из ДанныеПачек Цикл
			СтрЗапасы = ДокОбъект.Запасы.Добавить();
			СтрЗапасы.Номенклатура = СтрокаТовары.Номенклатура;
			СтрЗапасы.Количество = СтрокаТовары.Количество;
			СтрЗапасы.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаИзмерения;
			СтрЗапасы.Характеристика = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиКруглогоЛесоматериала(
			СтрокаТовары.Диаметр, СтрокаТовары.Порода, СтрокаТовары.ДлинаПачки, СтрокаТовары.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	 ДокОбъект.Записать(режимзаписидокумента.Запись);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДокОбъект = ПриходныйОрдер.ПолучитьОбъект();  
	ДокОбъект.Записать(режимзаписидокумента.Проведение);
	ЛокализацияДанныхПроизводство.ПроведениеПоДвижениюПроизводства(Движения, Ссылка,Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ДокОбъект = ПриходныйОрдер.ПолучитьОбъект();  
	ДокОбъект.Записать(режимзаписидокумента.ОтменаПроведения);
КонецПроцедуры
