
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СерияОбъект = ТекущийОбъект.СерияНоменклатуры.ПолучитьОбъект();
	СерияОбъект.Наименование = ТекущийОбъект.Код;
	СерияОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьКод(ТекущийОбъект,ПорядковыйНомер) 
//	СтруктураДанных = Новый Структура;
//	
//	СтруктураДанных = ТовароведУправляемая.ВычислитьНомерПакета(ТекущийОбъект.Смена,ТекущийОбъект.Подразделение,ТекущийОбъект.ДатаПакета);
//	ПорядковыйНомер = СтруктураДанных.ПорядковыйНомер;
//    ТекущийОбъект.Код = СтруктураДанных.КодПакета;	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаПакетаПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер);	
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер);
КонецПроцедуры                                             

&НаКлиенте
Процедура КоличествоДосокПриИзменении(Элемент)
	Объект.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(Объект.КоличествоДосок,Объект.Толщина,Объект.Ширина,Объект.Длина);	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 	
	ТекущийОбъект.Номенклатура = ТекущийОбъект.Стандарт.Номенклатура;
	ТекущийОбъект.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекущийОбъект.Стандарт.Порода,ТекущийОбъект.Толщина,ТекущийОбъект.Ширина,ТекущийОбъект.Стандарт.Сорт,ТекущийОбъект.Длина,ТекущийОбъект.Влажность,ТекущийОбъект.Номенклатура,Отказ);
	ТекущийОбъект.СерияНоменклатуры = КИТ_РаботаСДаннымиСервер.НайтиСериюНоменклатуры(ТекущийОбъект.Код,ТекущийОбъект.Номенклатура);
   	ТекущийОбъект.Наименование = ТекущийОбъект.Код+";"+ТекущийОбъект.Номенклатура+";"+ТекущийОбъект.ХарактеристикаНоменклатуры+";"+ТекущийОбъект.ДатаПакета;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
//	Если ПорядковыйНомер > СтарыйНомер Тогда
//		ТовароведУправляемая.ЗаписатьДанныеВРегистрНомераПакетов(Объект.Смена,Объект.Подразделение,ПорядковыйНомер);
//	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПВХ_Влажность = Константы.СвойствоДляВлажности.Получить();
	ВидДляПараметров = Перечисления.ВидыРеквизита.ГП;

	Если Параметры.Ключ.Пустая() Тогда

		Объект.Наименование = "№";
		Объект.Учетчик = Пользователи.ТекущийПользователь();
		Объект.ДатаПакета = ТекущаяДата();

	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	

КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



