&НаКлиенте
Процедура ВычислитьКод(ТекущийОбъект,ПорядковыйНомер) 
//	СтруктураДанных = Новый Структура;
//	
//	СтруктураДанных = ТовароведУправляемая.ВычислитьНомерПакета(ТекущийОбъект.Смена,ТекущийОбъект.Подразделение,ТекущийОбъект.ДатаПакета);
//	ПорядковыйНомер = СтруктураДанных.ПорядковыйНомер;
//    ТекущийОбъект.Код = СтруктураДанных.КодПакета;	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаПакетаПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер);	
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер);
КонецПроцедуры                                             

&НаКлиенте
Процедура КоличествоДосокПриИзменении(Элемент)
//	Объект.Объем = ТовароведУправляемая.ОбъемВычислить(Объект.КоличествоДосок,Объект.Толщина,Объект.Ширина,Объект.Длина);	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 	
//	ТекущийОбъект.Номенклатура = ТекущийОбъект.Стандарт.Номенклатура;
//	ТекущийОбъект.ХарактеристикаНоменклатуры = ТовароведУправляемая.НайтиХарактеристику(ТекущийОбъект.Номенклатура,Отказ,ТекущийОбъект);
//	ТекущийОбъект.СерияНоменклатуры = ТовароведУправляемая.НайтиСериюНоменклатуры(ТекущийОбъект.Код,ТекущийОбъект.Номенклатура);
//    ТекущийОбъект.Наименование = ТекущийОбъект.Код+";"+ТекущийОбъект.Номенклатура+";"+ТекущийОбъект.ХарактеристикаНоменклатуры+";"+ТекущийОбъект.ДатаПакета;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
//	Если ПорядковыйНомер > СтарыйНомер Тогда
//		ТовароведУправляемая.ЗаписатьДанныеВРегистрНомераПакетов(Объект.Смена,Объект.Подразделение,ПорядковыйНомер);
//	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Если Параметры.Ключ.Пустая() Тогда
//		СтарыйНомер = 0; 
//		ПорядковыйНомер = 0;
//		Объект.Наименование = "№";
//		Объект.Учетчик = ТовароведУправляемая.ПолучитьТекущегоПользователя();
//		Объект.ДатаПакета = ТекущаяДата();
//		Объект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Объект.Учетчик, "ПодразделениеТоваровед");
//	Иначе
//		СтарыйНомер = Число(Прав(Объект.Код,5)); 
//		ПорядковыйНомер = 0; 
//		ТолькоПросмотр = Товаровед.ПолучитьСостояниеПакетаЛСП(Объект.Ссылка)>0;
//		
//	КонецЕсли;
//    ПВХВлажность = ПланыВидовХарактеристик.СвойстваОбъектов.Влажность;
КонецПроцедуры


