&НаКлиенте
Процедура ОбновитьНаименование(Элемент)
	
	Объект.Наименование =  ""+Лев(Объект.Номенклатура,1)+" - "+Лев(Объект.Порода,1)+" - "+Объект.Диаметр+" штабель №"+Объект.НомерШтабеля;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	ПВХДиаметр = Константы.ХарактеристикаДиаметры.Получить();
	//Элементы.Номенклатура.СписокВыбора = Справочники.Номенклатура.НайтиПоКоду();
	//Элементы.Номенклатура.СписокВыбора = Справочники.Номенклатура.НайтиПоКоду();
КонецПроцедуры

&НаСервере
Процедура НоменклатураНачалоВыбораНаСервере(ДанныеВыбора)
//	ДанныеВыбора = Новый СписокЗначений;
//	ДанныеВыбора.Добавить(Справочники.Номенклатура.НайтиПоКоду("00000000562")); //Пиловочник неокоренный
//	ДанныеВыбора.Добавить(Справочники.Номенклатура.НайтиПоКоду("00000007650")); //Балансы 

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НоменклатураНачалоВыбораНаСервере(ДанныеВыбора);
КонецПроцедуры
