Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр СостояниеПакета
	Движения.СостояниеПакета.Записывать = Истина;
	Для Каждого ТекСтрокаВыпуск из Выпуск Цикл
		Если Не ЗначениеЗаполнено(ТекСтрокаВыпуск.Пакет) Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.СостояниеПакета.Добавить();
		Движение.Период = Дата;
		Движение.Пакет = ТекСтрокаВыпуск.Пакет;
		Движение.Состояние = Перечисления.СостоянияПакетов.Оприходован;
	КонецЦикла;

	ЛокализацияДанныхПроизводство.ПроведениеПоДвижениюПроизводства(Движения, Ссылка,Отказ);
	
КонецПроцедуры