
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого ТекСтрокаДанные Из ТекущийОбъект.Выпуск Цикл
			Если Не ЗначениеЗаполнено(ТекСтрокаДанные.ХарактеристикаНоменклатуры) Тогда
				ТекСтрокаДанные.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Стандарт.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Стандарт.Сорт,ТекСтрокаДанные.Длина,ТекСтрокаДанные.Влажность,ТекСтрокаДанные.Номенклатура,Отказ);
			КонецЕсли;		
		КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СырьеКоличествоДосокПриИзменении(Элемент)
	ТекДанные = Элементы.Сырье.ТекущиеДанные;
	ТекДанные.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ВыпускКоличествоДосокПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	ТекДанные.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ВыпускДлинаПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	ТекДанные.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ВыпускШиринаПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	ТекДанные.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ВыпускТолщинаПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	ТекДанные.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура СырьеДлинаПриИзменении(Элемент)
	ТекДанные = Элементы.Сырье.ТекущиеДанные;
	ТекДанные.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры


&НаКлиенте
Процедура СырьеШиринаПриИзменении(Элемент)
	ТекДанные = Элементы.Сырье.ТекущиеДанные;
	ТекДанные.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры


&НаКлиенте
Процедура СырьеТолщинаПриИзменении(Элемент)
	ТекДанные = Элементы.Сырье.ТекущиеДанные;
	ТекДанные.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СостояниеПакетаСрезПоследних.Состояние, ЗНАЧЕНИЕ(перечисление.СостоянияПакетов.НеОприходован)) КАК
		|		СостояниеПакета,
		|	СправочникПакеты.Ссылка КАК Пакет
		|ИЗ
		|	Справочник.Пакеты КАК СправочникПакеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеПакета.СрезПоследних(&Дата,) КАК СостояниеПакетаСрезПоследних
		|		ПО СправочникПакеты.Ссылка = СостояниеПакетаСрезПоследних.Пакет
		|ГДЕ
		|	ЕСТЬNULL(СостояниеПакетаСрезПоследних.Состояние,
		|		ЗНАЧЕНИЕ(перечисление.СостоянияПакетов.НеОприходован)) = ЗНАЧЕНИЕ(перечисление.СостоянияПакетов.НеОприходован)
		|	И СправочникПакеты.ДатаПакета МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СправочникПакеты.Смена = &Смена";
	
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТаб = Объект.Выпуск.Добавить();
		СтрокаТаб.Пакет = ВыборкаДетальныеЗаписи.Пакет;
		СтруктураДанныхПакета = КИТ_РаботаСДаннымиСервер.ДанныеПакета(СтрокаТаб.Пакет);
		ЗаполнитьЗначенияСвойств(СтрокаТаб, СтруктураДанныхПакета);

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратныеОтходыЦенаПриИзменении(Элемент)
	ПересчитатьСуммуВозвратныеОтходы();
КонецПроцедуры

&НаКлиенте
Процедура ВыпускПакетПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	СтруктураДанныхПакета = КИТ_РаботаСДаннымиКлиент.ПолучитьДанныеПакета(ТекДанные.Пакет);
	ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураДанныхПакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпускСтандартПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	
	ТекДанные.Номенклатура = ПолучитьНомеклатуру(ТекДанные.Стандарт);
КонецПроцедуры

&НаСервере
Функция ПолучитьНомеклатуру(Стандарт)

	Возврат Стандарт.Номенклатура;

КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПВХ_Влажность = Константы.СвойствоДляВлажности.Получить();
	ВидДляПараметров = Перечисления.ВидыРеквизита.ГП;
	ПВХ_Порода = Константы.СвойствоДляПородПЛ.Получить();
	ПВХ_Сорт = Константы.СвойствоДляСортов.Получить();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратныеОтходыКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммуВозвратныеОтходы();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуВозвратныеОтходы()

	ТекДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;

КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



