//
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
////	ПВХСорт = Константы.ХарактеристикаСорт.Получить();
////	ПВХПорода = Константы.ХарактеристикаПорода.Получить();
////	ПВХДиаметр = Константы.ХарактеристикаДиаметры.Получить();
////	Пиловочник = Константы.НоменклатураПиловочникПоУмолчанию.Получить();
//	
//	Если Параметры.Ключ.Пустая() Тогда
//		Объект.Ответственный = ТовароведУправляемая.ПолучитьТекущегоПользователя();
//		Объект.Дата = ТекущаяДата();
//		Объект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Объект.Ответственный, "ОсновнаяОрганизация");	
//		Объект.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Объект.Ответственный, "ОсновнойСклад");
//		Объект.ВидОперации = Перечисления.ВидыОперацийПриходныйОрдер.ОтПоставщика;
//	КонецЕсли;
//
//	ТаблицаПачек = Объект.Замеры.Выгрузить(,"Пачка,НомерПачки,КоличествоПоПачке");
//	ТаблицаПачек.Свернуть("Пачка,НомерПачки,КоличествоПоПачке");
//	
//	Для каждого СтрТаблицаПачек из ТаблицаПачек Цикл
//		СтруктураПоиска = Новый ("Структура");
//		СтруктураПоиска.Вставить("Пачка",СтрТаблицаПачек.Пачка);
//		ДанныйДерева = ДеревоЗамеров.ПолучитьЭлементы();
//		СтрПервыйУровень = ДанныйДерева.Добавить();
//		СтрПервыйУровень.Пачка = СтрТаблицаПачек.Пачка;
//		СтрПервыйУровень.НомерПачки = СтрТаблицаПачек.НомерПачки;
//		СтрПервыйУровень.Количество = СтрТаблицаПачек.КоличествоПоПачке;
//		МассивСтрок = Объект.Замеры.НайтиСтроки(СтруктураПоиска);
//		Для Счетчик=0 по МассивСтрок.Количество()-1 Цикл
//			СтрНоменклатуры = МассивСтрок[Счетчик];
//			ДанныеВторогоУровня = СтрПервыйУровень.ПолучитьЭлементы(); 
//			СтрВторойУровень = ДанныеВторогоУровня.Добавить();
//			СтрВторойУровень.Пачка = СтрНоменклатуры.Номенклатура;
//			СтрВторойУровень.Порода = СтрНоменклатуры.Порода;
//			СтрВторойУровень.Диаметр = СтрНоменклатуры.Диаметр;
//			СтрВторойУровень.Количество = СтрНоменклатуры.Количество;
//            СтрВторойУровень.Количество1 = СтрНоменклатуры.Количество1;
//			СтрВторойУровень.Количество2 = СтрНоменклатуры.Количество2;
//			СтрВторойУровень.Количество3 = СтрНоменклатуры.Количество3;
//			СтрВторойУровень.Количество4 = СтрНоменклатуры.Количество4;
//			СтрВторойУровень.Количество5 = СтрНоменклатуры.Количество5;
//			
//			//
//			СтрВторойУровень.Штабель = СтрНоменклатуры.Штабель;
//			ПородаШтабеля =  ШтабельПриИзмененииСервер(СтрНоменклатуры.Порода);
//			СтрВторойУровень.ПородаШтабеля = ПородаШтабеля;
//
//		КонецЦикла;
//	КонецЦикла;
//	СформироватьТаблицуДиаметров();
//
//	ЭтаФорма.Элементы.ГруппаДокументОснование.Доступность = Объект.ОтгрузкаНЗП ИЛИ Объект.СобственныйПиловочник ;
//		
//КонецПроцедуры
//
//&НаСервере
//Процедура СформироватьТаблицуДиаметров()
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 10;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.037;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 11;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.045;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 12;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.053;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 13;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.062;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 14;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.073;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 16;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.095;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 18;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.120;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 20;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.147;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 22;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.178;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 24;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.210;
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 26;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.250;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 28;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.290;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 30;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.330;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 32;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.380;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 34;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.430;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 36;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.480;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 38;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.530;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 40;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.580;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 42;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.640;
//	 
//	 СтрДиам = ТаблицаДиаметров.Добавить();
//	 СтрДиам.Диаметр = 44;
//	 СтрДиам.Длина = 4;
//	 СтрДиам.Объем = 0.700;
//	 
//	 
//КонецПроцедуры
//
//&НаКлиенте
//Процедура УстановитьВидимостьКолонокКоличество()
//	//Элементы.Замеры.ОтборСтрок
//	Для каждого СтрСорт из Объект.СоставЗамеров Цикл
//		Элементы["ЗамерыКоличество"+СтрСорт.НомерСтроки].Заголовок = СокрЛП(СтрСорт.Сорт)+",м3";//"("+СтрСорт.Порода+")"+Символы.ПС+СтрСорт.Сорт+",м3";
//		Элементы["ЗамерыКоличество"+СтрСорт.НомерСтроки].Видимость = Истина;
//		
//		Элементы["ДеревоЗамеровКоличество"+СтрСорт.НомерСтроки].Заголовок = СОкрЛП(СтрСорт.Сорт)+",м3";
//		Элементы["ДеревоЗамеровКоличество"+СтрСорт.НомерСтроки].Видимость = Истина;
//		
//		Элементы["ЗамерыРучнойУчетКоличество"+СтрСорт.НомерСтроки].Заголовок = СОкрЛП(СтрСорт.Сорт)+",м3";
//		Элементы["ЗамерыРучнойУчетКоличество"+СтрСорт.НомерСтроки].Видимость = Истина;
//
//	КонецЦикла;
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	УстановитьВидимостьКолонокКоличество();  
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ЗамерыКоличествоПриИзменении(Элемент)
//	СтрЗамеры = Элементы.Замеры.ТекущиеДанные;
//	Если СтрЗамеры = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//
//	Для каждого СтрСорт из Объект.СоставЗамеров Цикл
//		 СтрЗамеры["Количество"+СтрСорт.НомерСтроки] = Окр(СтрЗамеры.Количество * (СтрСорт.Процент/100),2);		
//	КонецЦикла;
//
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ЗамерыКоличество1ПриИзменении(Элемент)
//	СтрЗамеры = Элементы.Замеры.ТекущиеДанные;
//	Если СтрЗамеры = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	СтрЗамеры.Количество = СтрЗамеры.Количество1+СтрЗамеры.Количество2+СтрЗамеры.Количество3+СтрЗамеры.Количество4+СтрЗамеры.Количество5;
//КонецПроцедуры
//
//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	Отказ = Ложь;
//	ЭтоПроведение = ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
//	
//	Если ТекущийОбъект.ДанныеПачек.Количество() <> 0 Тогда
//	//Проверка ДереваЗамеров
//	ОшибокНет = Истина;
//	ДанныеДереваЗамеров = ДеревоЗамеров.ПолучитьЭлементы();
//	Для каждого УровеньПервыйДеревоЗамеров из ДанныеДереваЗамеров Цикл
//		 СуммаКоличество = 0;
//		 ДанныеВторогоУровня = УровеньПервыйДеревоЗамеров.ПолучитьЭлементы();
//		 Для Каждого УровеньВторойДеревоЗамеров из ДанныеВторогоУровня Цикл
//		 	СуммаКоличество = СуммаКоличество + УровеньВторойДеревоЗамеров.Количество;	 
//		КонецЦикла;
//		
//		Если СуммаКоличество <> УровеньПервыйДеревоЗамеров.Количество Тогда
//			ОшибокНет = Ложь;
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = "В пачке " + СокрЛП(УровеньПервыйДеревоЗамеров.Пачка)+" не равно общее количество";
//			Сообщение.Сообщить();
//		КонецЕсли;
//	КонецЦикла;
//	Если Не ОшибокНет Тогда
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;
//	
//	ТекущийОбъект.Замеры.Очистить();
//	
//	ДанныеДереваЗамеров = ДеревоЗамеров.ПолучитьЭлементы();
//	Для каждого УровеньПервыйДеревоЗамеров из ДанныеДереваЗамеров Цикл
//		 ДанныеВторогоУровня = УровеньПервыйДеревоЗамеров.ПолучитьЭлементы();
//		 Для Каждого УровеньВторойДеревоЗамеров из ДанныеВторогоУровня Цикл
//		 	СтрЗамеры = ТекущийОбъект.Замеры.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрЗамеры,УровеньВторойДеревоЗамеров);
//			СтрЗамеры.Пачка = УровеньПервыйДеревоЗамеров.Пачка;
//			СтрЗамеры.Номенклатура = УровеньВторойДеревоЗамеров.Пачка;
//			СтрЗамеры.НомерПачки = УровеньПервыйДеревоЗамеров.НомерПачки;
//			СтрЗамеры.КоличествоПоПачке = УровеньПервыйДеревоЗамеров.Количество;
//			
//			//22022021
//			СтрЗамеры.Штабель = УровеньВторойДеревоЗамеров.Штабель;
//		КонецЦикла;		
//	КонецЦикла;
//	КонецЕсли;
//	
//	Если ТекущийОбъект.Замеры.Количество()> 0 Тогда
//		ТекущийОбъект.Товары.Очистить();
//	КонецЕсли;
//	
//	Для каждого СтрЗамеры из ТекущийОбъект.Замеры Цикл
//		Для Счетчик =1 по 5 Цикл
//			Если СтрЗамеры["Количество"+Счетчик] = 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			СтрТовары = ТекущийОбъект.Товары.Добавить();
//			Если ТипЗнч(Объект.СоставЗамеров[Счетчик-1].Сорт) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
//				СтрТовары.Номенклатура = СтрЗамеры.Номенклатура;
//				СтрТовары.ЕдиницаИзмерения = СтрЗамеры.Номенклатура.ЕдиницаХраненияОстатков;
//				СтрТовары.Коэффициент = СтрТовары.ЕдиницаИзмерения.Коэффициент;
//				СтрТовары.ХарактеристикаНоменклатуры = НайтиХарактеристикуПоПараметрам(СтрЗамеры.Номенклатура, Отказ,СтрЗамеры.Порода,СтрЗамеры.Диаметр,ТекущийОбъект.СоставЗамеров[Счетчик-1].Сорт);
//			Иначе
//				СтрТовары.Номенклатура = ТекущийОбъект.СоставЗамеров[Счетчик-1].Сорт;
//				СтрТовары.ЕдиницаИзмерения = СтрТовары.Номенклатура.ЕдиницаХраненияОстатков;
//				СтрТовары.Коэффициент = СтрТовары.ЕдиницаИзмерения.Коэффициент;
//				СтрТовары.ХарактеристикаНоменклатуры = НайтиХарактеристикуПоПараметрам(СтрТовары.Номенклатура, Отказ,СтрЗамеры.Порода,Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка(),Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка());
//			КонецЕсли;
//			СтрТовары.Качество = Справочники.Качество.Новый;
//			СтрТовары.Количество = СтрЗамеры["Количество"+Счетчик];
//
//		КонецЦикла;		
//	КонецЦикла;
//	
//	Если ТекущийОбъект.ЗамерыРучнойУчет.Количество()> 0 Тогда
//		ТекущийОбъект.Товары.Очистить();
//	КонецЕсли;
//	
//	Для каждого СтрЗамеры из ТекущийОбъект.ЗамерыРучнойУчет Цикл
//		Если СтрЗамеры["Количество"] = 0 Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		Для Счетчик =1 по 5 Цикл
//			Если СтрЗамеры["Количество"+Счетчик] = 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			СтрТовары = ТекущийОбъект.Товары.Добавить();
//			Если ТипЗнч(Объект.СоставЗамеров[Счетчик-1].Сорт) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
//				СтрТовары.Номенклатура = СтрЗамеры.Номенклатура;
//				СтрТовары.ЕдиницаИзмерения = СтрЗамеры.Номенклатура.ЕдиницаХраненияОстатков;
//				СтрТовары.Коэффициент = СтрТовары.ЕдиницаИзмерения.Коэффициент;
//				СтрТовары.ХарактеристикаНоменклатуры = НайтиХарактеристикуПоПараметрам(СтрЗамеры.Номенклатура, Отказ,СтрЗамеры.Порода,СтрЗамеры.Диаметр,ТекущийОбъект.СоставЗамеров[Счетчик-1].Сорт);
//			Иначе
//				СтрТовары.Номенклатура = ТекущийОбъект.СоставЗамеров[Счетчик-1].Сорт;
//				СтрТовары.ЕдиницаИзмерения = СтрТовары.Номенклатура.ЕдиницаХраненияОстатков;
//				СтрТовары.Коэффициент = СтрТовары.ЕдиницаИзмерения.Коэффициент;
//				СтрТовары.ХарактеристикаНоменклатуры = НайтиХарактеристикуПоПараметрам(СтрТовары.Номенклатура, Отказ,СтрЗамеры.Порода,Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка(),Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка());
//			КонецЕсли;
//			СтрТовары.Качество = Справочники.Качество.Новый;
//			СтрТовары.Количество = СтрЗамеры["Количество"+Счетчик];
//
//		КонецЦикла;		
//	КонецЦикла;
//
//КонецПроцедуры 
//
//&НаСервере 
//Функция НайтиХарактеристикуПоПараметрам(НоменклатураПоиска, Отказ,Порода,Диаметр,Сорт) 
//	ХарактеристикаПоиска = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
//	ОбработкаОбъектЗначенияСвойств = Обработки.ЗначенияСвойствОбъекта.Создать();
//	ОбработкаОбъектЗначенияСвойств.НазначениеСвойств      = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры;
//	ОбработкаОбъектЗначенияСвойств.ОбъектОтбораНазначений = НоменклатураПоиска.Ссылка;
//	
//	// Перечитываются свойства.
//	ОбработкаОбъектЗначенияСвойств.ПрочитатьЗаполнитьСвойстваИЗначения();
//	
//	Свойства = ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения;
//	
//	СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаПорода.Получить(),"Свойство");
//	Если СтрокаСвойства <> Неопределено Тогда
//		СтрокаСвойства.Значение = Порода;
//	КонецЕсли;	
//
//	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//
//	СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаДиаметры.Получить(),"Свойство");
//	Если СтрокаСвойства <> Неопределено Тогда
//		СтрокаСвойства.Значение = Диаметр;
//	КонецЕсли;	 
//	
//	СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаСорт.Получить(),"Свойство");
//	Если СтрокаСвойства <> Неопределено Тогда
//		СтрокаСвойства.Значение = Сорт;
//	КонецЕсли;	 
//	
//	//СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаДлина.Получить(),"Свойство");
//	//Если СтрокаСвойства <> Неопределено Тогда
//	//	СтрокаСвойства.Значение = Длина.ДлинаХарактеристика;
//	//КонецЕсли;	
//	//
//	//СтрокаСвойства =  Свойства.Найти(ПланыВидовХарактеристик.СвойстваОбъектов.Влажность,"Свойство");
//	//Если СтрокаСвойства <> Неопределено Тогда
//	//	СтрокаСвойства.Значение = Влажность;
//	//КонецЕсли;
//	
//	
//	Если  Объект.Дата >= Дата('2019,01,01') Тогда
//		СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаСертификация.Получить(),"Свойство");
//		Если СтрокаСвойства <> Неопределено Тогда
//			СтрокаСвойства.Значение = ?(Не Объект.НаличиеСертификата, Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000716"), Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000715"));
//		КонецЕсли;
//	КонецЕсли;
//	
//	//12042022   c 08042022 всегда прочерк
//	Если  Объект.Дата >= Дата('2022,04,15') Тогда
//		СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаСертификация.Получить(),"Свойство");
//		Если СтрокаСвойства <> Неопределено Тогда
//			Сертификация =  Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000829");
//			СтрокаСвойства.Значение = Сертификация;
//		КонецЕсли;
//	КонецЕсли;
//
//	Характеристики = Новый ТаблицаЗначений;
//	// Заполняется список характеристик.
//	ОтобратьХарактеристики(Характеристики,НоменклатураПоиска,ОбработкаОбъектЗначенияСвойств);
//	
//	Если Характеристики.Количество()=0 и рольДоступна("ПолныеПрава") Тогда
//		СправочникОбъектХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
//		
//		СправочникОбъектХарактеристика.Владелец     = НоменклатураПоиска.Ссылка;
//		СправочникОбъектХарактеристика.Наименование = СправочникОбъектХарактеристика.СформироватьНаименование(ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения);
//		
//		СправочникОбъектХарактеристика.Активная = Истина;
//		СправочникОбъектХарактеристика.Записать();
//		ХарактеристикаПоиска = СправочникОбъектХарактеристика.Ссылка;
//		ОбработкаОбъектЗначенияСвойств.ОбъектОтбораЗначений = СправочникОбъектХарактеристика.Ссылка;
//		Отказ = НЕ ОбработкаОбъектЗначенияСвойств.ЗаписатьЗначенияСвойств();
//		
//		ОтобратьХарактеристики(Характеристики,НоменклатураПоиска,ОбработкаОбъектЗначенияСвойств); 
//	КонецЕсли;
//	
//	Если Характеристики.Количество()>0 Тогда
//		ХарактеристикаПоиска = Характеристики[0].Характеристика;
//	ИНАЧЕ   
//		
//		//Попытка
//		//	СправочникОбъектХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
//		//	
//		//	СправочникОбъектХарактеристика.Владелец     = НоменклатураПоиска.Ссылка;
//		//	СправочникОбъектХарактеристика.Наименование = СправочникОбъектХарактеристика.СформироватьНаименование(ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения);
//		//	
//		//	//// Открыть форму объекта
//		//	ФормаХарактеристики = СправочникОбъектХарактеристика.ПолучитьФорму("ФормаЭлемента", );
//		//	//ФормаХарактеристики.Открыть();
//		//	
//		//	// Установить значения свойств новой характеристики
//		//	Для Каждого Строка Из ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения Цикл
//		//		
//		//		Если ЗначениеЗаполнено(Строка.Значение) Тогда
//		//			
//		//			СтрокаЗначенияСвойств = ФормаХарактеристики.ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения.Найти(Строка.Свойство, "Свойство");
//		//			
//		//			Если СтрокаЗначенияСвойств <> Неопределено Тогда
//		//				СтрокаЗначенияСвойств.Значение = Строка.Значение;
//		//			КонецЕсли;
//		//		КонецЕсли;
//		//		
//		//	КонецЦикла;
//		//	СправочникОбъектХарактеристика.Активная = Истина;
//		//	СправочникОбъектХарактеристика.Записать();
//		//	ХарактеристикаПоиска = СправочникОбъектХарактеристика.Ссылка;
//		//	ОбработкаОбъектЗначенияСвойств.ОбъектОтбораЗначений = СправочникОбъектХарактеристика.Ссылка;
//		//	Отказ = НЕ ОбработкаОбъектЗначенияСвойств.ЗаписатьЗначенияСвойств();
//
//		//Исключение
//		//12042022   c 15042022 всегда прочерк
//		Если  Объект.Дата >= Дата('2022,04,15') Тогда
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = "Не найдена характеристика! у номенклатуры "+НоменклатураПоиска
//			+Символы.ПС+" параметры Порода "+Порода
//			+Символы.ПС+" параметры Сорт "+Сорт
//			+Символы.ПС+" параметры Диаметр "+Диаметр
//			+Символы.ПС+" параметры Сертификация "+Сертификация
//			+" Проверьте настройки!"+Символы.ПС+" Документ НЕ БУДЕТ ЗАПИСАН!!!!";
//			Сообщение.Поле = "ВАЖНО";					
//		Иначе 
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = "Не найдена характеристика! у номенклатуры "+НоменклатураПоиска
//			+Символы.ПС+" параметры Порода "+Порода
//			+Символы.ПС+" параметры Сорт "+Сорт
//			+Символы.ПС+" параметры Диаметр "+Диаметр
//			+Символы.ПС+" параметры Сертификация "+?(Не Объект.НаличиеСертификата, "Несертифицированный", "Сертифицированный")
//			+" Проверьте настройки!"+Символы.ПС+" Документ НЕ БУДЕТ ЗАПИСАН!!!!";
//			Сообщение.Поле = "ВАЖНО";			
//		КонецЕсли;
//	
//		Сообщение.Сообщить();
//		Если ЭтоПроведение Тогда 
//			Отказ = Истина; // -*- 15042022 
//		КонецЕсли;
//		
//		//КонецПопытки;
//	КонецЕсли;	
//	
//	Возврат ХарактеристикаПоиска;	
//КонецФункции
//
// &НаСервере
//Процедура ОтобратьХарактеристики(Характеристики,ПараметрВыборПоВладельцу,ОбработкаОбъектЗначенияСвойств)
//	
//	Запрос = Новый Запрос();
//	
//	Запрос.УстановитьПараметр("ВладелецХарактеристики", ПараметрВыборПоВладельцу);
//	
//	Запрос.Текст = "
//	|ВЫБРАТЬ 
//	|	ХарактеристикиНоменклатуры.ПометкаУдаления                  КАК ПометкаУдаления,
//	|	ХарактеристикиНоменклатуры.Характеристика                   КАК Характеристика
//	|
//	|ИЗ
//	|	(
//	|	ВЫБРАТЬ 
//	|		Справочник.ХарактеристикиНоменклатуры.ПометкаУдаления   КАК ПометкаУдаления,
//	|		Справочник.ХарактеристикиНоменклатуры.Ссылка            КАК Характеристика
//	|
//	|	ИЗ
//	|		Справочник.ХарактеристикиНоменклатуры
//	|
//	|	ГДЕ
//	|		Справочник.ХарактеристикиНоменклатуры.Владелец = &ВладелецХарактеристики
//	|
//	|	)                                                           КАК ХарактеристикиНоменклатуры
//	|";
//	
//	Для каждого Строка Из ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения Цикл
//		Если ЗначениеЗаполнено(Строка.Значение) Тогда
//			Индекс = ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения.Индекс(Строка);
//			
//			Запрос.УстановитьПараметр("Свойство" + Индекс, Строка.Свойство);
//			Запрос.УстановитьПараметр("Значение" + Индекс, Строка.Значение);
//			
//			Запрос.Текст = Запрос.Текст + "
//			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//			|	РегистрСведений.ЗначенияСвойствОбъектов             КАК ЗначенияСвойствОбъектов" + Индекс + "
//			|
//			|ПО
//			|	ЗначенияСвойствОбъектов" + Индекс + ".Объект = ХарактеристикиНоменклатуры.Характеристика
//			|	И
//			|	ЗначенияСвойствОбъектов" + Индекс + ".Свойство = &Свойство" + Индекс +"
//			|	И
//			|	ЗначенияСвойствОбъектов" + Индекс + ".Значение = &Значение" + Индекс +"
//			|";
//		КонецЕсли;
//	КонецЦикла;
//	
//	Характеристики = Запрос.Выполнить().Выгрузить();
//	
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ДеревоЗамеровКоличествоПриИзменении(Элемент)
//	СтрЗамеры = Элементы.ДеревоЗамеров.ТекущиеДанные;
//	Если СтрЗамеры = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если СтрЗамеры.ПолучитьРодителя() = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Для каждого СтрСорт из Объект.СоставЗамеров Цикл
//		 СтрЗамеры["Количество"+СтрСорт.НомерСтроки] = Окр(СтрЗамеры.Количество * (СтрСорт.Процент/100),2);		
//	КонецЦикла;
//
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ДеревоЗамеровКоличество1ПриИзменении(Элемент)
//	СтрЗамеры = Элементы.ДеревоЗамеров.ТекущиеДанные;
//	Если СтрЗамеры = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	Если СтрЗамеры.ПолучитьРодителя() = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//
//	СтрЗамеры.Количество = СтрЗамеры.Количество1+СтрЗамеры.Количество2+СтрЗамеры.Количество3+СтрЗамеры.Количество4+СтрЗамеры.Количество5;
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ДеревоЗамеровПередНачаломИзменения(Элемент, Отказ)
//	СтрЗамеры = Элементы.ДеревоЗамеров.ТекущиеДанные;
//	Если СтрЗамеры = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	Если НЕ Элементы.ДеревоЗамеров.ТекущийЭлемент.Имя = "ДеревоЗамеровШтабель" Тогда 
//		Если СтрЗамеры.ПолучитьРодителя() = Неопределено Тогда
//			Отказ = Истина;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ДанныеПачекДлинаПачкиПриИзменении(Элемент)
//	
//	СтрПачек = Элементы.ДанныеПачек.ТекущиеДанные;
//	Если СтрПачек = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//    СтрПачек.Количество = СтрПачек.ДлинаПачки*СтрПачек.ШиринаПачки*СтрПачек.ВысотаПачки*СтрПачек.КоэффицентДревесности;
//КонецПроцедуры
//
//&НаКлиенте
//Процедура СформироватьДанные(Команда)
//	ДанныеДереваЗамеров = ДеревоЗамеров.ПолучитьЭлементы();
//	Для каждого СтрДанныеПачек из Объект.ДанныеПачек Цикл
//		ЕстьПачкаВДереве = Ложь;
//		Для каждого СТрДанныеДереваЗамеров из ДанныеДереваЗамеров Цикл
//			ЕстьПачкаВДереве  = СТрДанныеДереваЗамеров.НомерПачки = СтрДанныеПачек.НомерСтроки;
//		КонецЦикла;
//		Если Не ЕстьПачкаВДереве Тогда
//			НоваяСтрокаДереваЗамеров = ДанныеДереваЗамеров.Добавить();
//			НоваяСтрокаДереваЗамеров.НомерПачки = СтрДанныеПачек.НомерСтроки;
//			НоваяСтрокаДереваЗамеров.Пачка = "№"+СтрДанныеПачек.НомерСтроки + " B="+СтрДанныеПачек.ШиринаПачки+ " * H="+СтрДанныеПачек.ВысотаПачки+ " * L="+СтрДанныеПачек.ДлинаПачки+ " * k="+СтрДанныеПачек.КоэффицентДревесности;
//			НоваяСтрокаДереваЗамеров.Количество = СтрДанныеПачек.Количество;
//		КонецЕсли;
//	КонецЦикла;
//	Элементы.Дерево.Видимость = Истина;
//	Элементы.Страницы.ТекущаяСтраница = Элементы.Дерево;
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ДеревоЗамеровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
//	Если Элемент.ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
//		Отказ = Истина;
//	КонецЕсли;
//	Если Элемент.ТекущийЭлемент.Имя = "ДеревоЗамеровПачка" Тогда
//		ТипСтр = "СправочникСсылка.Номенклатура";
//   		Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
//   		Элемент.ТекущийЭлемент.ВыбиратьТип = Ложь;
//	КонецЕсли;
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ДеревоЗамеровПачкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	ТипСтр = "СправочникСсылка.Номенклатура";
//    Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
//    Элемент.ВыбиратьТип = Ложь; 
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ДанныеПачекПередУдалением(Элемент, Отказ)
//	СтрДанныеПачки = Элемент.ТекущиеДанные;
//	Если СтрДанныеПачки = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	ДанныеДереваЗамеров = ДеревоЗамеров.ПолучитьЭлементы();
//	Для каждого СтрДеревоЗамеров из ДанныеДереваЗамеров Цикл
//		Если СтрДеревоЗамеров.НомерПачки = СтрДанныеПачки.НомерСтроки Тогда
//			ДанныеДереваЗамеров.Удалить(СтрДеревоЗамеров);
//		КонецЕсли;
//	КонецЦикла;	
//КонецПроцедуры
//
//&НаКлиенте
//Процедура СоставЗамеровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
//	УстановитьВидимостьКолонокКоличество(); 
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ДеревоЗамеровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Пачка) и НоваяСтрока Тогда
//    	Элемент.ТекущиеДанные.Пачка = Пиловочник;
//	КонецЕсли;
//
//	//22022021
//	ПородаШтабеля =  ШтабельПриИзмененииСервер(Элемент.ТекущиеДанные.Порода);
//	Элемент.ТекущиеДанные.ПородаШтабеля = ПородаШтабеля;
//
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ЗамерыРучнойУчетДиаметрЧислоПриИзменении(Элемент)
//	СтрЗамеры = Элементы.ЗамерыРучнойУчет.ТекущиеДанные;
//	Если СтрЗамеры = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	Попытка
//		СтруктураПоискаДиам = Новый Структура;
//		СтруктураПоискаДиам.Вставить("Диаметр",СтрЗамеры.ДиаметрЧисло);
//		СтруктураПоискаДиам.Вставить("Длина",СтрЗамеры.Длина);
//		
//		СтрТабДиам = ТаблицаДиаметров.НайтиСтроки(СтруктураПоискаДиам);
//		СтрЗамеры.Количество = СтрЗамеры.КоличествоШтук*СтрТабДиам[0].Объем;
//	Исключение
//    КонецПопытки;
//	Для каждого СтрСорт из Объект.СоставЗамеров Цикл
//		 СтрЗамеры["Количество"+СтрСорт.НомерСтроки] = Окр(СтрЗамеры.Количество * (СтрСорт.Процент/100),2);		
//	КонецЦикла;
//
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ЗамерыРучнойУчетКоличествоПриИзменении(Элемент)
//	СтрЗамеры = Элементы.ЗамерыРучнойУчет.ТекущиеДанные;
//	Если СтрЗамеры = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//
//	Для каждого СтрСорт из Объект.СоставЗамеров Цикл
//		 СтрЗамеры["Количество"+СтрСорт.НомерСтроки] = Окр(СтрЗамеры.Количество * (СтрСорт.Процент/100),2);		
//	КонецЦикла;
//
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ЗамерыРучнойУчетКоличество1ПриИзменении(Элемент)
//	СтрЗамеры = Элементы.ЗамерыРучнойУчет.ТекущиеДанные;
//	Если СтрЗамеры = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	СтрЗамеры.Количество = СтрЗамеры.Количество1+СтрЗамеры.Количество2+СтрЗамеры.Количество3+СтрЗамеры.Количество4+СтрЗамеры.Количество5;
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ЗамерыРучнойУчетПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) и НоваяСтрока Тогда
//    	Элемент.ТекущиеДанные.Номенклатура = Пиловочник;
//	КонецЕсли;
//
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ЗамерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) и НоваяСтрока Тогда
//    	Элемент.ТекущиеДанные.Номенклатура = Пиловочник;
//	КонецЕсли;
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ЗаполнитьДиаметры(Команда)
//	Для счетчик = ДиаметрНачальный по ДиаметрКонечный Цикл
//		Если (Счетчик/2-Окр(Счетчик/2))<> 0 Тогда
//			Продолжить;
//		КонецЕсли;
//		СтрЗамеры = Объект.ЗамерыРучнойУчет.Добавить();
//		СтрЗамеры.Номенклатура = Пиловочник;
//		СтрЗамеры.Порода = ПородаДляЗаполнения;
//		СтрЗамеры.ДиаметрЧисло = счетчик;
//		СтрЗамеры.Длина  = 4;
//	КонецЦикла;
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ОтвественноеХранениеПриИзменении(Элемент)
//	Если Объект.ОтвественноеХранение Тогда
////		Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходныйОрдер.НеОпределен");
//	КонецЕсли;
//КонецПроцедуры
//
//&НаСервере
//Процедура ЗаполнитьНаСервере()
//
//	НомерВходящегоДокумента = Прав("00000000"+Формат(СокрЛП(Объект.НомерВходящегоДокумента),"ЧЦ=6; ЧГ=0"),7);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РасходныйОрдерНаТовары.Ссылка,
//		|	ПОДСТРОКА(РасходныйОрдерНаТовары.Номер, 5, 11) КАК НомерБезПрефикса
//		|ИЗ
//		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
//		|ГДЕ
//		|	ПОДСТРОКА(РасходныйОрдерНаТовары.Номер, 5, 11) ПОДОБНО &номер
//		|	И РасходныйОрдерНаТовары.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
//	
//	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.ДатаВходящегоДокумента));
//	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаВходящегоДокумента);
//	Запрос.УстановитьПараметр("Номер", НомерВходящегоДокумента);
//
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Объект.ДокументОснование = ВыборкаДетальныеЗаписи.Ссылка;
//	КонецЦикла;
//	
//КонецПроцедуры
//
//&НаСервере
//Процедура ЗаполнитьНаСервере_до_26022018()
//	НомерВходящегоДокумента = "";
//	ДлинаНомера = СтрДлина(Объект.НомерВходящегоДокумента);
//	Если ДлинаНомера < 3 Тогда 
//		НомерВходящегоДокумента = ?(ДлинаНомера = 2, "0"+Объект.НомерВходящегоДокумента, "00"+Объект.НомерВходящегоДокумента);  	
//	Иначе
//		НомерВходящегоДокумента = Объект.НомерВходящегоДокумента;
//	КонецЕсли;	
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РасходныйОрдерНаТовары.Ссылка,
//		|	ПОДСТРОКА(РасходныйОрдерНаТовары.Номер, 6, 11) КАК НомерБезПрефикса
//		|ИЗ
//		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
//		|ГДЕ
//		|	ПОДСТРОКА(РасходныйОрдерНаТовары.Номер, 6, 11) ПОДОБНО &номер
//		|	И РасходныйОрдерНаТовары.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
//	
//	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.ДатаВходящегоДокумента));
//	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаВходящегоДокумента);
//	Запрос.УстановитьПараметр("Номер", "000" + НомерВходящегоДокумента);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Объект.ДокументОснование = ВыборкаДетальныеЗаписи.Ссылка;
//	КонецЦикла;
//	
//КонецПроцедуры
//
//&НаКлиенте
//Процедура Заполнить(Команда)
//	ЗаполнитьНаСервере();
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ОтгрузкаНЗППриИзменении(Элемент)
//	ЭтаФорма.Элементы.ГруппаДокументОснование.Доступность = Объект.ОтгрузкаНЗП ИЛИ Объект.СобственныйПиловочник;
//	Если Не Объект.ОтгрузкаНЗП и НЕ Объект.СобственныйПиловочник Тогда
//		Объект.ДокументОснование = Неопределено;
//	КонецЕсли;	
//КонецПроцедуры
//
//&НаСервере
//Функция  ШтабельПриИзмененииСервер(ЗначенийСвойстваПорода)
//	 Возврат Справочники.Порода.НайтиПоРеквизиту("ПородаХарактеристика",ЗначенийСвойстваПорода);
//КонецФункции
//
//&НаКлиенте
//Процедура ДеревоЗамеровШтабельОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	Модифицированность = Истина;
//КонецПроцедуры
//
//
//
