Перем ПорядковыйНомерПоСмене экспорт;
Перем ОбработкаОбъектЗначенияСвойств экспорт;

Процедура ВычислитьНомерПакета() Экспорт
	ПорядковыйНомерПоСмене = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераПакетовПоСменам.ПорядковыйНомер КАК ПорядковыйНомер
		|ИЗ
		|	РегистрСведений.НомераПакетовПоСменам КАК НомераПакетовПоСменам
		|ГДЕ
		|	НомераПакетовПоСменам.Смена = &Смена
		|	И НомераПакетовПоСменам.ПодразделениеТоваровед = &ПодразделениеТоваровед";

	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("ПодразделениеТоваровед", Подразделение);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПорядковыйНомерПоСмене = ВыборкаДетальныеЗаписи.ПорядковыйНомер;
	КонецЦикла;
	
	//Поищем номер пакета, если уже записали тогда +1, нет тот же номер
	ПорядковыйНомерПоСмене = ?(ПорядковыйНомерПоСмене=0,1,ПорядковыйНомерПоСмене+1);
		
	Код =  ВычислитьКодПакета(ПорядковыйНомерПоСмене);
	
КонецПроцедуры

Функция ВычислитьКодПакета(ПорядковыйНомерПоСмене)
	НомерПакета ="";		
	Если НачалоГода(ДатаПакета)  >= Дата('20210101') Тогда
		НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),2) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	Иначе
	    НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),1) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	КонецЕсли;

	//НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),2) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	
	Возврат НомерПакета;
	
КонецФункции

//Поиск характеристики по показателям
Процедура ОтобратьХарактеристики(Характеристики,ПараметрВыборПоВладельцу)
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ВладелецХарактеристики", ПараметрВыборПоВладельцу);
	
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	ХарактеристикиНоменклатуры.ПометкаУдаления                  КАК ПометкаУдаления,
	|	ХарактеристикиНоменклатуры.Характеристика                   КАК Характеристика
	|
	|ИЗ
	|	(
	|	ВЫБРАТЬ 
	|		Справочник.ХарактеристикиНоменклатуры.ПометкаУдаления   КАК ПометкаУдаления,
	|		Справочник.ХарактеристикиНоменклатуры.Ссылка            КАК Характеристика
	|
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры
	|
	|	ГДЕ
	|		Справочник.ХарактеристикиНоменклатуры.Владелец = &ВладелецХарактеристики
	|
	|	)                                                           КАК ХарактеристикиНоменклатуры
	|";
	
	Для каждого Строка Из ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения Цикл
		Если ЗначениеЗаполнено(Строка.Значение) Тогда
			Индекс = ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения.Индекс(Строка);
			
			Запрос.УстановитьПараметр("Свойство" + Индекс, Строка.Свойство);
			Запрос.УстановитьПараметр("Значение" + Индекс, Строка.Значение);
			
			Запрос.Текст = Запрос.Текст + "
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	РегистрСведений.ЗначенияСвойствОбъектов             КАК ЗначенияСвойствОбъектов" + Индекс + "
			|
			|ПО
			|	ЗначенияСвойствОбъектов" + Индекс + ".Объект = ХарактеристикиНоменклатуры.Характеристика
			|	И
			|	ЗначенияСвойствОбъектов" + Индекс + ".Свойство = &Свойство" + Индекс +"
			|	И
			|	ЗначенияСвойствОбъектов" + Индекс + ".Значение = &Значение" + Индекс +"
			|";
		КонецЕсли;
	КонецЦикла;
	
	Характеристики = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Функция НайтиХарактеристику(НоменклатураПоиска, Отказ,ЗаписыватьЕслиНеНайден = ложь) Экспорт
	ХарактеристикаПоиска = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
	ОбработкаОбъектЗначенияСвойств = Обработки.ЗначенияСвойствОбъекта.Создать();
	ОбработкаОбъектЗначенияСвойств.НазначениеСвойств      = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры;
	ОбработкаОбъектЗначенияСвойств.ОбъектОтбораНазначений = НоменклатураПоиска.Ссылка;
	
	// Перечитываются свойства.
	ОбработкаОбъектЗначенияСвойств.ПрочитатьЗаполнитьСвойстваИЗначения();
	
	Свойства = ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения;
	
	СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаПорода.Получить(),"Свойство");
	Если СтрокаСвойства <> Неопределено Тогда
		СтрокаСвойства.Значение = Стандарт.Порода.ПородаХарактеристика;
	КонецЕсли;	 
	
	Сечение = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоотвествиеСечений.Сечение КАК Сечение
		|ИЗ
		|	РегистрСведений.СоотвествиеСечений КАК СоотвествиеСечений
		|ГДЕ
		|	СоотвествиеСечений.Толщина = &Толщина
		|	И СоотвествиеСечений.Ширина = &Ширина";

	Запрос.УстановитьПараметр("Толщина", Толщина);
	Запрос.УстановитьПараметр("Ширина", Ширина);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сечение = ВыборкаДетальныеЗаписи.Сечение;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(Сечение) Тогда
	//	Если НЕ ЗаписыватьЕслиНеНайден Тогда
			Сообщение = Новый СообщениеПользователю;
			//Сообщение.Текст = "Не найдено нужного соотвествия сечения! Проверьте настройки!";
			Сообщение.Текст = "Не найдено нужного соответствия сечения! "+Толщина+"x"+Ширина+". Проверьте настройки!";

			Сообщение.Поле = "ВАЖНО";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат ХарактеристикаПоиска;
		//Иначе
		//	НаименованиеСечения = СокрЛП(Толщина)+"*"+СокрЛП(Ширина); 
		//	ЗначениеХарактеритики = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(НаименованиеСечения,истина,,Константы.ХарактеристикаСечение.Получить());
		//	Если ЗначениеЗаполнено(ЗначениеХарактеритики) Тогда
		//		Сечение = ЗначениеХарактеритики.Ссылка; 
		//		РегСведенияСечения = РегистрыСведений.СоотвествиеСечений.СоздатьНаборЗаписей();
		//		РегСведенияСечения.Прочитать();
		//		ЗапРегСведенияСечения = РегСведенияСечения.Добавить();
		//		ЗапРегСведенияСечения.Активность = Истина;
		//		ЗапРегСведенияСечения.Сечение = ЗначениеХарактеритики.Ссылка;
		//		ЗапРегСведенияСечения.Толщина = Толщина;
		//		ЗапРегСведенияСечения.Ширина = Ширина;
		//		РегСведенияСечения.Записать(Истина);				
		//	Иначе	
		//		Сообщение = Новый СообщениеПользователю;
		//		Сообщение.Текст = "Не найдено нужного сечения " +НаименованиеСечения+"! Проверьте настройки!";
		//		Сообщение.Поле = "ВАЖНО";
		//		Сообщение.УстановитьДанные(ЭтотОбъект);
		//		Сообщение.Сообщить();
		//		Отказ = Истина;
		//		Возврат ХарактеристикаПоиска;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаСечение.Получить(),"Свойство");
	Если СтрокаСвойства <> Неопределено Тогда
		СтрокаСвойства.Значение = Сечение;
	КонецЕсли;	 
	
	СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаСорт.Получить(),"Свойство");
	Если СтрокаСвойства <> Неопределено Тогда
		СтрокаСвойства.Значение = Стандарт.Сорт;
	КонецЕсли;	 
	
	СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаДлина.Получить(),"Свойство");
	Если СтрокаСвойства <> Неопределено Тогда
		СтрокаСвойства.Значение = Длина.ДлинаХарактеристика;
	КонецЕсли;	
	СтрокаСвойства =  Свойства.Найти(ПланыВидовХарактеристик.СвойстваОбъектов.Влажность,"Свойство");
	Если СтрокаСвойства <> Неопределено Тогда
		СтрокаСвойства.Значение = Влажность;
	КонецЕсли;	
			
	Если  ДатаПакета >= Дата('2022,04,14') Тогда
		СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаСертификация.Получить(),"Свойство");
		Если СтрокаСвойства <> Неопределено Тогда
			СтрокаСвойства.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000829");
		КонецЕсли;	
	ИначеЕсли  ДатаПакета >= Дата('2019,02,04') Тогда
		СтрокаСвойства =  Свойства.Найти(Константы.ХарактеристикаСертификация.Получить(),"Свойство");
		Если СтрокаСвойства <> Неопределено Тогда
			СтрокаСвойства.Значение = ?(Несертифицированный, Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000716"), Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000715"));
		КонецЕсли;
	КонецЕсли;

	Характеристики = Новый ТаблицаЗначений;
	// Заполняется список характеристик.
	ОтобратьХарактеристики(Характеристики,НоменклатураПоиска);
	
	Если Характеристики.Количество()>0 Тогда
		ХарактеристикаПоиска = Характеристики[0].Характеристика;
	ИНАЧЕ
		Если ЗаписыватьЕслиНеНайден Тогда
			СправочникОбъектХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			
			СправочникОбъектХарактеристика.Владелец     = НоменклатураПоиска.Ссылка;
			СправочникОбъектХарактеристика.Наименование = СправочникОбъектХарактеристика.СформироватьНаименование(ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения);
			
			//// Открыть форму объекта
			ФормаХарактеристики = СправочникОбъектХарактеристика.ПолучитьФорму("ФормаЭлемента", );
			//ФормаХарактеристики.Открыть();
			
			// Установить значения свойств новой характеристики
			Для Каждого Строка Из ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения Цикл
				
				Если ЗначениеЗаполнено(Строка.Значение) Тогда
					
					СтрокаЗначенияСвойств = ФормаХарактеристики.ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения.Найти(Строка.Свойство, "Свойство");
					
					Если СтрокаЗначенияСвойств <> Неопределено Тогда
						СтрокаЗначенияСвойств.Значение = Строка.Значение;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			СправочникОбъектХарактеристика.Активная = Истина;
			СправочникОбъектХарактеристика.Записать();
			ХарактеристикаПоиска = СправочникОбъектХарактеристика.Ссылка;
			ОбработкаОбъектЗначенияСвойств.ОбъектОтбораЗначений = СправочникОбъектХарактеристика.Ссылка;
			Отказ = НЕ ОбработкаОбъектЗначенияСвойств.ЗаписатьЗначенияСвойств();
			
		Иначе	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не найдено нужной характеристики! Проверьте настройки! Звоните программистам!";
			Сообщение.Поле = "ВАЖНО";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ХарактеристикаПоиска;
	
КонецФункции

//Поиск серии и создание. Связка Номенклатура + Характеристика + Серия
Функция НайтиСериюНоменклатуры(КодСерии,НоменклатураСерии) Экспорт
	СерияПакета = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка КАК СЕРИЯ
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.СерийныйНомер = &СерийныйНомер";

	Запрос.УстановитьПараметр("СерийныйНомер", КодСерии);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СерияПакета = ВыборкаДетальныеЗаписи.СЕРИЯ;		
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Если Не ЗначениеЗаполнено(СерияПакета) Тогда
		
		СерияПакетОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		СерияПакетОбъект.Владелец = НоменклатураСерии;
		СерияПакетОбъект.Наименование = КодСерии;
		СерияПакетОбъект.СерийныйНомер = КодСерии;
		СерияПакетОбъект.Записать();
		СерияПакета = СерияПакетОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СерияПакета;
	
КонецФункции

Процедура ЗаписатьПакет(Отказ) Экспорт
	Наименование = Код+";"+Номенклатура+";"+ХарактеристикаНоменклатуры+";"+ДатаПакета;
	Номенклатура = Стандарт.Номенклатура;
	ХарактеристикаНоменклатуры = НайтиХарактеристику(Номенклатура,Отказ,Истина);
	СерияНоменклатуры = НайтиСериюНоменклатуры(Код,Номенклатура);
КонецПроцедуры	

Процедура ПриКопировании(ОбъектКопирования)
	СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
КонецПроцедуры

ПорядковыйНомерПоСмене =0;

