Перем ПорядковыйНомерПоСмене экспорт;

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = ""+Подразделение.НомерОрганизации+Подразделение.НомерПодразделения;
КонецПроцедуры



Процедура ПередЗаписью(Отказ)
	Наименование =  Код+";"+Номенклатура+";"+ХарактеристикаНоменклатуры+";"+ДатаПакета;
КонецПроцедуры


Функция ВычислитьКодПакета(ПорядковыйНомерПоСмене)
	НомерПакета ="";		
	Если НачалоГода(ДатаПакета)  >= Дата('20210101') Тогда
		НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),2) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	Иначе
	    НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),1) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	КонецЕсли;

	//НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),2) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	
	Возврат НомерПакета;
	
КонецФункции

//Поиск серии и создание. Связка Номенклатура + Характеристика + Серия
Функция НайтиСериюНоменклатуры(КодСерии,НоменклатураСерии) Экспорт
	СерияПакета = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка КАК СЕРИЯ
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.СерийныйНомер = &СерийныйНомер";

	Запрос.УстановитьПараметр("СерийныйНомер", КодСерии);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СерияПакета = ВыборкаДетальныеЗаписи.СЕРИЯ;		
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Если Не ЗначениеЗаполнено(СерияПакета) Тогда
		
		СерияПакетОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		СерияПакетОбъект.Владелец = НоменклатураСерии;
		СерияПакетОбъект.Наименование = КодСерии;
		СерияПакетОбъект.СерийныйНомер = КодСерии;
		СерияПакетОбъект.Записать();
		СерияПакета = СерияПакетОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СерияПакета;
	
КонецФункции

Процедура ЗаписатьПакет(Отказ) Экспорт
	Наименование = Код+";"+Номенклатура+";"+ХарактеристикаНоменклатуры+";"+ДатаПакета;
	Номенклатура = Стандарт.Номенклатура;
	//ХарактеристикаНоменклатуры = НайтиХарактеристику(Номенклатура,Отказ,Истина);
	СерияНоменклатуры = НайтиСериюНоменклатуры(Код,Номенклатура);
КонецПроцедуры	

Процедура ПриКопировании(ОбъектКопирования)
	СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
КонецПроцедуры



