
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура КИТ_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	СписокОбъектов.Добавить(Документы.ПриходныйОрдерНаКруглыйЛесоматериал);
	СписокОбъектов.Добавить(Документы.ОтчетПроизводстваЗаСменуОкорка);
	СписокОбъектов.Добавить(Документы.ОтчетПроизводстваЗаСменуЛесоцех);
	СписокОбъектов.Добавить(Документы.ОтчетПроизводстваЗаСменуЛСП);
	СписокОбъектов.Добавить(Документы.УкладкаВШтабель);
	СписокОбъектов.Добавить(Документы.ЗагрузкаВСушильнуюКамеру);
	СписокОбъектов.Добавить(Документы.ВыгрузкаИзСушильнойКамеры);
	СписокОбъектов.Добавить(Справочники.Пакеты);
КонецПроцедуры
