
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДата()); 
	Если Параметры.ЕстьУсловиеПоЗапросу Тогда
		Список.ТекстЗапроса = Список.ТекстЗапроса+"
		|ГДЕ
		|";
		УсловиеПервое = Истина;
		Если Параметры.СостояниеПакета <> 0 Тогда
			Если УсловиеПервое Тогда
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				|ЕСТЬNULL(СостояниеПакетаСрезПоследних.Состояние, 0) = &СостояниеПакета 
				|"; 
				УсловиеПервое = Ложь;
			Иначе
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				| И ЕСТЬNULL(СостояниеПакетаСрезПоследних.Состояние, 0) = &СостояниеПакета
				|"; 				
			КонецЕсли;
			Список.Параметры.УстановитьЗначениеПараметра("СостояниеПакета", ?(Параметры.СостояниеПакета<0,0,Параметры.СостояниеПакета));
		КонецЕсли;
		Если Параметры.Номеклатура.Количество()>0 Тогда
			Если УсловиеПервое Тогда
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				|СправочникПакеты.Номенклатура В (&Номенклатура) 
				|"; 
				УсловиеПервое = Ложь;
			Иначе
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				| И СправочникПакеты.Номенклатура В (&Номенклатура) 
				|"; 				
			КонецЕсли;
			Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номеклатура);		
		КонецЕсли;
		Если Параметры.ХарактеристикаНоменклатуры.Количество()>0 Тогда
			Если УсловиеПервое Тогда
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				|СправочникПакеты.ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры) 
				|"; 
				УсловиеПервое = Ложь;
			Иначе
				Список.ТекстЗапроса = Список.ТекстЗапроса+"
				| И СправочникПакеты.ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры) 
				|"; 				
			КонецЕсли;
			Список.Параметры.УстановитьЗначениеПараметра("ХарактеристикаНоменклатуры", Параметры.ХарактеристикаНоменклатуры);		
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
